app/Controllers/LoginAdmin.php

SELECT *
FROM `tb_admin`
WHERE `email` = 'muh.isairawanto@gmail.com'
 LIMIT 1
---
    public function prosesLoginAdmin()
    {
        $ModelAdmin = new ModelAdmin();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Validasi input
        $validation = \Config\Services::validation();
        $validation->setRules([
            'email' => 'required|valid_email',
            'password' => 'required|min_length[6]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        // Cek user di database
        $user = $ModelAdmin->where('email', $email)->first();