app/Models/ModelSiswa.php

    public function getSiswaWithKelas()
    {
       return $this->select('tb_siswa.*, tb_kelas.nama_kelas')
                    ->join('tb_kelas', 'tb_kelas.id_kelas = tb_siswa.id_kelas')
                    ->findAll();
---
SELECT `tb_siswa`.*, `tb_kelas`.`nama_kelas`
FROM `tb_siswa`
JOIN `tb_kelas` ON `tb_kelas`.`id_kelas` = `tb_siswa`.`id_kelas`