app/Models/ModelMapel.php

    public function getMapelByKelas($id_kelas)
    {
        return $this->select('tb_mapel.*, tb_kelas.nama_kelas, tb_kelas.nama_kelas')
                    ->join('tb_kelas', 'tb_kelas.id_kelas = tb_mapel.id_kelas')
                    ->join('tb_guru', 'tb_guru.id_guru = tb_mapel.id_guru')
                    ->where('tb_mapel.id_kelas', $id_kelas)
                    ->findAll();
---
SELECT `tb_mapel`.*, `tb_kelas`.`nama_kelas`, `tb_kelas`.`nama_kelas`
FROM `tb_mapel`
JOIN `tb_kelas` ON `tb_kelas`.`id_kelas` = `tb_mapel`.`id_kelas`
JOIN `tb_guru` ON `tb_guru`.`id_guru` = `tb_mapel`.`id_guru`
WHERE `tb_mapel`.`id_kelas` = '4'